{
  "section1": {
    "title": "Short title, extent and commencement",
    "bare_act": {
      "id": "s1_bare_act",
      "title": "Section 1 - Complete Bare Act",
      "main": {
        "english": "Section 1: Short title, extent and commencement (1) This Act may be called the Bharatiya Nagarik Suraksha Sanhita, 2023. (2) The provisions of this Sanhita, other than those relating to Chapters IX, XI and XII thereof, shall not apply to the State of Nagaland and to the tribal areas, but the concerned State Government may, by notification, apply such provisions or any of them to the whole or part of the State of Nagaland or such tribal areas, as the case may be, with such supplemental, incidental or consequential modifications, as may be specified in the notification. Explanation: In this section, 'tribal areas' means the territories which immediately before the 21st day of January, 1972, were included in the tribal areas of Assam, as referred to in paragraph 20 of the Sixth Schedule to the Constitution, other than those within the local limits of the municipality of Shillong. (3) It shall come into force on such date as the Central Government may, by notification in the Official Gazette, appoint. Footnote: 1st July, 2024, except the provisions of the entry relation to Section 106(2) in the first Schedule, vide notification No. S.O. 848(E), dated 23rd day of February, 2024.",
        "hindi": "धारा 1: संक्षिप्त शीर्षक, विस्तार और प्रारंभ (1) इस अधिनियम को भारतीय नागरिक सुरक्षा संहिता, 2023 कहा जा सकता है। (2) इस संहिता के प्रावधान, धारा 9, 11 और 12 से संबंधित प्रावधानों को छोड़कर, नागालैंड राज्य और जनजातीय क्षेत्रों पर लागू नहीं होंगे, लेकिन संबंधित राज्य सरकार अधिसूचना द्वारा, ऐसे प्रावधानों या उनमें से किसी को नागालैंड राज्य या ऐसे जनजातीय क्षेत्रों के पूरे या किसी भाग पर लागू कर सकती है, जैसा कि अधिसूचना में निर्दिष्ट किया जा सकता है। व्याख्या: इस धारा में, 'जनजातीय क्षेत्र' का अर्थ उन क्षेत्रों से है जो 21 जनवरी, 1972 से तुरंत पहले असम के जनजातीय क्षेत्रों में शामिल थे, जैसा कि संविधान की छठी अनुसूची के पैराग्राफ 20 में संदर्भित है, शिलांग नगरपालिका की स्थानीय सीमाओं के भीतर उन क्षेत्रों को छोड़कर। (3) यह ऐसी तारीख को लागू होगा जो केंद्र सरकार अधिसूचना द्वारा निर्धारित कर सकती है। पाद टिप्पणी: 1 जुलाई, 2024, पहली अनुसूची में धारा 106(2) से संबंधित प्रविष्टि के प्रावधानों को छोड़कर, अधिसूचना संख्या S.O. 848(E), दिनांक 23 फरवरी, 2024 के माध्यम से।"
      },
      "what": {
        "english": "The bare act of Section 1 contains three subsections: (1) Declares the official name Bharatiya Nagarik Suraksha Sanhita, 2023, (2) Provides exemptions for Nagaland and tribal areas from most provisions except Chapters IX, XI, XII, and (3) States the commencement date to be notified by Central Government. This is the complete legal text as enacted by Parliament.",
        "hindi": "धारा 1 का मूल पाठ तीन उप-धाराओं में विभाजित है: (1) आधिकारिक नाम भारतीय नागरिक सुरक्षा संहिता, 2023 की घोषणा करता है, (2) नागालैंड और जनजातीय क्षेत्रों को अधिकांश प्रावधानों से छूट देता है सिवाय अध्याय IX, XI, XII के, और (3) केंद्र सरकार द्वारा अधिसूचित की जाने वाली प्रारंभ तारीख बताता है। यह संसद द्वारा अधिनियमित संपूर्ण कानूनी पाठ है।"
      },
      "why": {
        "english": "The bare act text is important because it provides the exact legal language used in the statute. Courts and legal professionals rely on this precise wording for interpretation and application. Like reading the original Constitution rather than a summary, the exact words matter in law.",
        "hindi": "मूल पाठ महत्वपूर्ण है क्योंकि यह कानून में प्रयुक्त सटीक भाषा प्रदान करता है। न्यायालय और कानूनी पेशेवर व्याख्या और आवेदन के लिए इस सटीक शब्दावली पर निर्भर करते हैं। संविधान के मूल पाठ को पढ़ने की तरह, कानून में सटीक शब्द महत्वपूर्ण हैं।"
      },
      "where": {
        "english": "This bare act text appears at the very beginning of the Bharatiya Nagarik Suraksha Sanhita, 2023. It is Section 1 of the Act, found in the official gazette notification. Located on the first pages of the official BNSS publication.",
        "hindi": "यह मूल पाठ भारतीय नागरिक सुरक्षा संहिता, 2023 की शुरुआत में प्रकट होता है। यह अधिनियम की धारा 1 है, जो आधिकारिक गजट अधिसूचना में पाई जाती है। आधिकारिक BNSS प्रकाशन के पहले पृष्ठों पर स्थित।"
      },
      "when": {
        "english": "Section 1 was enacted in 2023 as part of BNSS. Subsection (3) states the Act came into force on 1st July, 2024, as notified by the Central Government. The law was passed in 2023 but became operational from July 1, 2024.",
        "hindi": "धारा 1 को 2023 में BNSS के भाग के रूप में अधिनियमित किया गया था। उप-धारा (3) में कहा गया है कि अधिनियम 1 जुलाई, 2024 को लागू हुआ, जैसा कि केंद्र सरकार द्वारा अधिसूचित किया गया था। कानून 2023 में पारित हुआ लेकिन 1 जुलाई, 2024 से संचालन शुरू हुआ।"
      },
      "which": {
        "english": "This is Section 1 of BNSS 2023, titled Short title, extent and commencement. It is the foundational section containing three subsections that establish the law's identity, territorial extent, and effective date. Among all sections of BNSS, this is the introductory section that sets the stage.",
        "hindi": "यह BNSS 2023 की धारा 1 है, जिसका शीर्षक संक्षिप्त शीर्षक, विस्तार और प्रारंभ है। यह मूल धारा है जिसमें तीन उप-धाराएं हैं जो कानून की पहचान, क्षेत्रीय विस्तार और प्रभावी तारीख स्थापित करती हैं। BNSS की सभी धाराओं में, यह परिचयात्मक धारा है जो मंच तैयार करती है।"
      },
      "how": {
        "english": "Section 1 operates through three mechanisms: (1) Subsection-1 declares the name declaratively, (2) Subsection-2 creates exemptions with flexibility for State Governments to apply provisions through notification, (3) Subsection-3 delegates commencement power to Central Government. It establishes identity, scope, and timing all in one section.",
        "hindi": "धारा 1 तीन तंत्रों के माध्यम से संचालित होती है: (1) उप-धारा-1 नाम की घोषणा करती है, (2) उप-धारा-2 राज्य सरकारों के लिए अधिसूचना के माध्यम से प्रावधान लागू करने के लिए छूट और लचीलापन प्रदान करती है, (3) उप-धारा-3 प्रारंभ शक्ति को केंद्र सरकार को सौंपती है। यह एक ही धारा में पहचान, दायरा और समय सभी स्थापित करता है।"
      }
    },
    "subsection_1": {
      "id": "ss1",
      "title": "Law's Official Name",
      "main": {
        "english": "Subsection-1: Law's Official Name. This law is called the Bharatiya Nagarik Suraksha Sanhita, 2023. The complete title establishes the legal identity of this code. It consists of four Hindi words followed by the year 2023.",
        "hindi": "उप-धारा-1: कानून का आधिकारिक नाम। इस कानून को भारतीय नागरिक सुरक्षा संहिता, 2023 कहा जाता है। संपूर्ण शीर्षक इस संहिता की कानूनी पहचान स्थापित करता है। इसमें चार हिंदी शब्द और फिर वर्ष 2023 है।"
      },
      "what": {
        "english": "Subsection-1 states: This law is officially called Bharatiya Nagarik Suraksha Sanhita, 2023. Just like saying My name is John, this subsection declares the law's official name.",
        "hindi": "उप-धारा-1 कहती है: यह कानून आधिकारिक रूप से भारतीय नागरिक सुरक्षा संहिता, 2023 कहलाता है। जैसे कहना मेरा नाम राज है, यह उप-धारा कानून का आधिकारिक नाम घोषित करती है।"
      },
      "why": {
        "english": "Subsection-1 exists to officially declare the law's name for legal recognition. Without this subsection, the law would have no formal identity. Like a birth certificate that officially names a child, this subsection officially names the law.",
        "hindi": "उप-धारा-1 कानून के नाम की आधिकारिक घोषणा के लिए कानूनी मान्यता के लिए मौजूद है। इस उप-धारा के बिना, कानून का कोई औपचारिक पहचान नहीं होता। जैसे जन्म प्रमाण पत्र किसी बच्चे को आधिकारिक रूप से नाम देता है, यह उप-धारा कानून को आधिकारिक रूप से नाम देती है।"
      },
      "where": {
        "english": "Subsection-1 appears at the very beginning of the BNSS 2023 document. It is the first subsection of Section 1. Found on the opening page of the official BNSS text, before any other provisions.",
        "hindi": "उप-धारा-1 BNSS 2023 दस्तावेज़ की शुरुआत में दिखाई देती है। यह धारा 1 की पहली उप-धारा है। आधिकारिक BNSS पाठ के खुलने वाले पृष्ठ पर पाई जाती है, किसी अन्य प्रावधान से पहले।"
      },
      "when": {
        "english": "Subsection-1 came into effect in 2023 when the law was enacted. This naming provision became official with the passage of the Act. Since 2023, this subsection has been the legal reference point for the law's name.",
        "hindi": "उप-धारा-1 2023 में तब लागू हुई जब कानून अधिनियमित किया गया। यह नामकरण प्रावधान अधिनियम के पारित होने के साथ आधिकारिक हो गया। 2023 के बाद से, यह उप-धारा कानून के नाम के लिए कानूनी संदर्भ बिंदु रही है।"
      },
      "which": {
        "english": "Subsection-1 is the naming clause of BNSS 2023. It is the first and foundational subsection of Section 1. Among all subsections, this is the one that specifically addresses the law's title.",
        "hindi": "उप-धारा-1 BNSS 2023 की नामकरण खंड है। यह धारा 1 की पहली और मूल उप-धारा है। सभी उप-धाराओं में, यह वह है जो विशेष रूप से कानून के शीर्षक को संबोधित करती है।"
      },
      "how": {
        "english": "Subsection-1 works by providing a simple declarative statement: This law is called... It establishes legal nomenclature through direct declaration. Legal professionals cite this subsection when referencing the law's official name in documents.",
        "hindi": "उप-धारा-1 एक सरल घोषणात्मक बयान प्रदान करके काम करती है: इस कानून को कहा जाता है... यह सीधी घोषणा के माध्यम से कानूनी नामकरण स्थापित करता है। कानूनी पेशेवर दस्तावेज़ों में कानून के आधिकारिक नाम का संदर्भ देते समय इस उप-धारा को उद्धृत करते हैं।"
      }
    },
    "subsection_2": {
      "id": "ss2",
      "title": "Special Provisions for Nagaland and Tribal Areas",
      "main": {
        "english": "Subsection-2: Special Provisions for Nagaland and Tribal Areas. This subsection exempts Nagaland and tribal areas from most provisions of BNSS. Only Chapters IX, XI, and XII apply to these areas by default. State Governments can choose to apply other provisions with modifications.",
        "hindi": "उप-धारा-2: नागालैंड और जनजातीय क्षेत्रों के लिए विशेष प्रावधान। यह उप-धारा नागालैंड और जनजातीय क्षेत्रों को BNSS के अधिकांश प्रावधानों से छूट देती है। केवल अध्याय IX, XI, और XII डिफ़ॉल्ट रूप से इन क्षेत्रों पर लागू होते हैं। राज्य सरकारें संशोधन के साथ अन्य प्रावधान लागू करना चुन सकती हैं।"
      },
      "what": {
        "english": "Subsection-2 states that most provisions of BNSS do not apply to Nagaland and tribal areas, except Chapters IX, XI, and XII. State Governments can notify to apply other provisions with modifications. Like giving special autonomy to certain regions based on their unique needs.",
        "hindi": "उप-धारा-2 कहती है कि BNSS के अधिकांश प्रावधान नागालैंड और जनजातीय क्षेत्रों पर लागू नहीं होते हैं, सिवाय अध्याय IX, XI, और XII के। राज्य सरकारें संशोधन के साथ अन्य प्रावधान लागू करने के लिए अधिसूचित कर सकती हैं। कुछ क्षेत्रों को उनकी अनूठी जरूरतों के आधार पर विशेष स्वायत्तता देने के समान।"
      },
      "why": {
        "english": "Subsection-2 exists to respect the special constitutional status of Nagaland and tribal areas. These regions have unique cultural, social, and legal traditions that need protection. Like Article 371A which grants special provisions to Nagaland, this subsection ensures their autonomy while maintaining national legal framework.",
        "hindi": "उप-धारा-2 नागालैंड और जनजातीय क्षेत्रों की विशेष संवैधानिक स्थिति का सम्मान करने के लिए मौजूद है। इन क्षेत्रों की अनूठी सांस्कृतिक, सामाजिक और कानूनी परंपराएं हैं जिन्हें सुरक्षा की आवश्यकता है। अनुच्छेद 371A की तरह जो नागालैंड को विशेष प्रावधान देता है, यह उप-धारा राष्ट्रीय कानूनी ढांचे को बनाए रखते हुए उनकी स्वायत्तता सुनिश्चित करती है।"
      },
      "where": {
        "english": "Subsection-2 applies to: (a) The State of Nagaland, and (b) Tribal areas as defined under the Constitution. These are specially protected regions with distinct legal status. Scheduled Areas under Fifth Schedule and Tribal Areas under Sixth Schedule of the Indian Constitution.",
        "hindi": "उप-धारा-2 लागू होती है: (ए) नागालैंड राज्य को, और (बी) संविधान के अंतर्गत परिभाषित जनजातीय क्षेत्रों को। ये विशेष रूप से संरक्षित क्षेत्र हैं जिनकी अलग कानूनी स्थिति है। भारतीय संविधान की पाँचवीं अनुसूची के तहत अनुसूचित क्षेत्र और छठी अनुसूची के तहत जनजातीय क्षेत्र।"
      },
      "when": {
        "english": "Subsection-2 came into effect with BNSS in 2023. State Governments can issue notifications at any time to apply provisions to these areas. There's no fixed timeline - it depends on when the State Government decides. A State can notify today, tomorrow, or years later based on their assessment.",
        "hindi": "उप-धारा-2 2023 में BNSS के साथ लागू हुई। राज्य सरकारें किसी भी समय इन क्षेत्रों पर प्रावधान लागू करने के लिए अधिसूचनाएं जारी कर सकती हैं। कोई निश्चित समय सारणी नहीं है - यह इस बात पर निर्भर करता है कि राज्य सरकार कब निर्णय लेती है। एक राज्य अपने मूल्यांकन के आधार पर आज, कल या वर्षों बाद अधिसूचित कर सकता है।"
      },
      "which": {
        "english": "Subsection-2 identifies: (1) Which areas are exempt: Nagaland and tribal areas. (2) Which chapters DO apply: Chapters IX, XI, and XII. (3) Which provisions DON'T apply: All other chapters. If BNSS has 20 chapters, only 3 automatically apply to these regions; remaining 17 are optional.",
        "hindi": "उप-धारा-2 पहचानती है: (1) कौन से क्षेत्र छूट प्राप्त हैं: नागालैंड और जनजातीय क्षेत्र। (2) कौन से अध्याय लागू होते हैं: अध्याय IX, XI, और XII। (3) कौन से प्रावधान लागू नहीं होते हैं: अन्य सभी अध्याय। यदि BNSS में 20 अध्याय हैं, तो केवल 3 स्वचालित रूप से इन क्षेत्रों पर लागू होते हैं; शेष 17 वैकल्पिक हैं।"
      },
      "how": {
        "english": "Subsection-2 works through a notification system: Step 1: State Government decides which provisions to apply. Step 2: Issues official notification. Step 3: Can add supplemental or consequential modifications. Step 4: Provisions become applicable as per notification. Like a menu where the State picks what legal provisions suit their region best.",
        "hindi": "उप-धारा-2 एक अधिसूचना प्रणाली के माध्यम से काम करती है: चरण 1: राज्य सरकार तय करती है कि कौन से प्रावधान लागू करें। चरण 2: आधिकारिक अधिसूचना जारी करता है। चरण 3: पूरक या परिणामी संशोधन जोड़ सकता है। चरण 4: प्रावधान अधिसूचना के अनुसार लागू हो जाते हैं। एक मेनू की तरह जहां राज्य यह चुनता है कि कौन से कानूनी प्रावधान उनके क्षेत्र के लिए सबसे उपयुक्त हैं।"
      }
    },
    "explanation_to_subsection_2": {
      "id": "ss2_explanation",
      "title": "Definition of Tribal Areas",
      "main": {
        "english": "Explanation to Subsection-2: Definition of Tribal Areas. Defines what tribal areas means for the purpose of Subsection-2. Refers to territories included in Assam's tribal areas as of January 21, 1972. Excludes the municipality of Shillong from this definition. Based on Paragraph 20 of the Sixth Schedule to the Constitution.",
        "hindi": "उप-धारा-2 की व्याख्या: जनजातीय क्षेत्रों की परिभाषा। उप-धारा-2 के उद्देश्य के लिए जनजातीय क्षेत्र का अर्थ परिभाषित करता है। 21 जनवरी, 1972 की स्थिति के अनुसार असम के जनजातीय क्षेत्रों में शामिल क्षेत्रों को संदर्भित करता है। इस परिभाषा से शिलांग नगरपालिका को बाहर करता है। संविधान की छठी अनुसूची के पैराग्राफ 20 पर आधारित।"
      },
      "what": {
        "english": "The Explanation states: Tribal areas means the territories which were part of Assam's tribal areas immediately before January 21, 1972, as mentioned in Paragraph 20 of the Sixth Schedule to the Constitution, except areas within Shillong municipality. Like defining a specific geographic region using a historical reference date.",
        "hindi": "व्याख्या कहती है: जनजातीय क्षेत्र का अर्थ उन क्षेत्रों से है जो 21 जनवरी, 1972 से तुरंत पहले असम के जनजातीय क्षेत्रों का हिस्सा थे, जैसा कि संविधान की छठी अनुसूची के पैराग्राफ 20 में उल्लेख है, शिलांग नगरपालिका के भीतर के क्षेत्रों को छोड़कर। एक ऐतिहासिक संदर्भ तारीख का उपयोग करके एक विशिष्ट भौगोलिक क्षेत्र को परिभाषित करने जैसे।"
      },
      "why": {
        "english": "This Explanation exists to provide legal clarity on which areas qualify as tribal areas under Subsection-2. It prevents confusion by fixing a specific date (January 21, 1972) and constitutional reference. Like defining minor as person below 18 years, it removes ambiguity about who qualifies for special provisions.",
        "hindi": "यह व्याख्या उप-धारा-2 के तहत कौन से क्षेत्र जनजातीय क्षेत्रों के रूप में योग्य हैं इसके बारे में कानूनी स्पष्टता प्रदान करने के लिए मौजूद है। यह एक विशिष्ट तारीख (21 जनवरी, 1972) और संवैधानिक संदर्भ तय करके भ्रम को रोकता है। अवयस्क को 18 वर्ष से कम उम्र के व्यक्ति के रूप में परिभाषित करने की तरह, यह स्पष्ट करता है कि कौन विशेष प्रावधानों के लिए योग्य है।"
      },
      "where": {
        "english": "The Explanation applies to territories that were: (a) Part of Assam's tribal areas before January 21, 1972, (b) Mentioned in Paragraph 20 of Sixth Schedule, and (c) NOT within Shillong municipality limits. Areas like parts of Meghalaya that were tribal areas of Assam before 1972, excluding Shillong city.",
        "hindi": "व्याख्या उन क्षेत्रों पर लागू होती है जो थे: (ए) 21 जनवरी, 1972 से पहले असम के जनजातीय क्षेत्रों का हिस्सा, (बी) छठी अनुसूची के पैराग्राफ 20 में उल्लेखित, और (सी) शिलांग नगरपालिका की सीमा के भीतर नहीं। मेघालय के ऐसे भाग जो 1972 से पहले असम के जनजातीय क्षेत्र थे, शिलांग शहर को छोड़कर।"
      },
      "when": {
        "english": "The Explanation uses January 21, 1972 as the cut-off date. This is historically significant because it was when Meghalaya became a full state. Territories included as tribal areas immediately before this date qualify. If an area was tribal area on January 20, 1972, it qualifies; if designated after January 21, 1972, it doesn't.",
        "hindi": "व्याख्या 21 जनवरी, 1972 को कट-ऑफ तारीख के रूप में उपयोग करती है। यह ऐतिहासिक रूप से महत्वपूर्ण है क्योंकि यह वह तारीख है जब मेघालय एक पूर्ण राज्य बना। इस तारीख से तुरंत पहले जनजातीय क्षेत्र के रूप में शामिल क्षेत्र योग्य हैं। यदि कोई क्षेत्र 20 जनवरी, 1972 को जनजातीय क्षेत्र था, तो वह योग्य है; यदि 21 जनवरी, 1972 के बाद नामित किया गया, तो नहीं।"
      },
      "which": {
        "english": "The Explanation identifies: (1) Which areas qualify: Former Assam tribal areas as of Jan 21, 1972. (2) Which constitutional provision: Paragraph 20 of Sixth Schedule. (3) Which areas are excluded: Shillong municipality. Of all tribal areas, only those meeting these three criteria qualify for Subsection-2 exemption.",
        "hindi": "व्याख्या पहचानती है: (1) कौन से क्षेत्र योग्य हैं: 21 जनवरी, 1972 की असम के पूर्व जनजातीय क्षेत्र। (2) कौन सा संवैधानिक प्रावधान: छठी अनुसूची का पैराग्राफ 20। (3) कौन से क्षेत्र बाहर रखे गए हैं: शिलांग नगरपालिका। सभी जनजातीय क्षेत्रों में से, केवल वे ही उप-धारा-2 छूट के लिए योग्य हैं जो इन तीनों मानदंडों को पूरा करते हैं।"
      },
      "how": {
        "english": "The Explanation works by establishing three criteria: Step 1: Check if area was tribal area of Assam. Step 2: Verify status immediately before Jan 21, 1972. Step 3: Confirm it's referenced in Sixth Schedule Para 20. Step 4: Ensure it's NOT within Shillong municipality. Like a checklist - only areas meeting all conditions qualify as tribal areas under BNSS.",
        "hindi": "व्याख्या तीन मानदंड स्थापित करके काम करती है: चरण 1: जांचें कि क्षेत्र असम का जनजातीय क्षेत्र था या नहीं। चरण 2: 21 जनवरी, 1972 से तुरंत पहले स्थिति की पुष्टि करें। चरण 3: पुष्टि करें कि यह छठी अनुसूची पैराग्राफ 20 में संदर्भित है। चरण 4: सुनिश्चित करें कि यह शिलांग नगरपालिका के भीतर नहीं है। एक चेकलिस्ट की तरह - केवल सभी शर्तों को पूरा करने वाले क्षेत्र BNSS के तहत जनजातीय क्षेत्र के रूप में योग्य हैं।"
      }
    },
    "subsection_3": {
      "id": "ss3",
      "title": "Date of Commencement",
      "main": {
        "english": "Subsection-3: Date of Commencement. This law comes into force on the date notified by Central Government. The notification must be published in the Official Gazette. Different provisions may come into force on different dates. Actual enforcement date: 1st July, 2024 (with one exception).",
        "hindi": "उप-धारा-3: प्रारंभ की तारीख। यह कानून केंद्र सरकार द्वारा अधिसूचित तारीख को लागू होता है। अधिसूचना को आधिकारिक गजट में प्रकाशित किया जाना चाहिए। विभिन्न प्रावधान विभिन्न तारीखों को लागू हो सकते हैं। वास्तविक प्रवर्तन तारीख: 1 जुलाई, 2024 (एक अपवाद के साथ)।"
      },
      "what": {
        "english": "Subsection-3 states: This law shall come into force on the date appointed by Central Government through official notification in the Gazette. The actual date notified was 1st July, 2024. Like announcing School will start from Monday, this subsection announces when the law officially begins.",
        "hindi": "उप-धारा-3 कहती है: यह कानून केंद्र सरकार द्वारा गजट में आधिकारिक अधिसूचना के माध्यम से नियुक्त तारीख को लागू होगा। अधिसूचित वास्तविक तारीख 1 जुलाई, 2024 थी। स्कूल सोमवार से शुरू होगा की घोषणा करने की तरह, यह उप-धारा घोषणा करती है कि कानून कब आधिकारिक रूप से शुरू होता है।"
      },
      "why": {
        "english": "Subsection-3 exists because laws need a clear start date for implementation. It allows time for preparation: training officials, setting up systems, and informing the public. Like giving advance notice before new traffic rules, authorities need time to prepare before enforcing the law.",
        "hindi": "उप-धारा-3 मौजूद है क्योंकि कानूनों को कार्यान्वयन के लिए एक स्पष्ट शुरुआत तारीख की आवश्यकता होती है। यह तैयारी के लिए समय देता है: अधिकारियों को प्रशिक्षित करना, सिस्टम सेट करना, और जनता को सूचित करना। नए ट्रैफिक नियमों से पहले अग्रिम सूचना देने की तरह, अधिकारियों को कानून लागू करने से पहले तैयारी का समय चाहिए।"
      },
      "where": {
        "english": "Subsection-3 applies throughout India where BNSS is applicable (except exempt areas under Subsection-2). The notification is published in the Official Gazette of India. The commencement date is uniform across all non-exempt territories of India.",
        "hindi": "उप-धारा-3 भारत भर में लागू होती है जहां BNSS लागू है (उप-धारा-2 के अंतर्गत छूट प्राप्त क्षेत्रों को छोड़कर)। अधिसूचना भारत के आधिकारिक गजट में प्रकाशित की जाती है। प्रारंभ तारीख भारत के सभी गैर-छूट प्राप्त क्षेत्रों में समान है।"
      },
      "when": {
        "english": "Subsection-3 became relevant on 23rd February, 2024 when the notification was issued. The law came into force on 1st July, 2024. Timeline: Law passed in 2023, Notification issued 23-Feb-2024, Enforcement began 01-Jul-2024. About 4 months between notification and actual implementation.",
        "hindi": "उप-धारा-3 23 फरवरी, 2024 को प्रासंगिक हुई जब अधिसूचना जारी की गई थी। कानून 1 जुलाई, 2024 को लागू हुआ। समय सारणी: कानून 2023 में पारित, अधिसूचना 23-फरवरी-2024 को जारी, प्रवर्तन 01-जुलाई-2024 से शुरू। अधिसूचना और वास्तविक कार्यान्वयन के बीच लगभग 4 महीने।"
      },
      "which": {
        "english": "Subsection-3 is the commencement clause - the provision that activates the law. It is the third and final subsection of Section 1. Exception: Provisions related to Section 106(2) in First Schedule had different timing. 99% of BNSS started on 1st July 2024; one specific provision had separate timing.",
        "hindi": "उप-धारा-3 प्रारंभ खंड है - वह प्रावधान जो कानून को सक्रिय करता है। यह धारा 1 की तीसरी और अंतिम उप-धारा है। अपवाद: पहली अनुसूची में धारा 106(2) से संबंधित प्रावधानों का समय अलग था। BNSS का 99% 1 जुलाई, 2024 को शुरू हुआ; एक विशिष्ट प्रावधान का अलग समय था।"
      },
      "how": {
        "english": "Subsection-3 works through this mechanism: Step 1: Central Government decides readiness date. Step 2: Issues notification (S.O. 848(E) dated 23-Feb-2024). Step 3: Publishes in Official Gazette. Step 4: Law becomes enforceable on appointed date (01-Jul-2024). Like flipping a switch - one specific moment when the law turns on.",
        "hindi": "उप-धारा-3 इस तंत्र के माध्यम से काम करती है: चरण 1: केंद्र सरकार तैयारी की तारीख तय करती है। चरण 2: अधिसूचना जारी करता है (S.O. 848(E) दिनांक 23-फरवरी-2024)। चरण 3: आधिकारिक गजट में प्रकाशित करता है। चरण 4: कानून नियुक्त तारीख (01-जुलाई-2024) को लागू हो जाता है। एक स्विच को फ्लिप करने की तरह - वह विशिष्ट क्षण जब कानून चालू होता है।"
      }
    },
    "footnote_1": {
      "id": "footnote1",
      "title": "Commencement Date Notification Details",
      "main": {
        "english": "Footnote-1: Commencement Notification Details. Notification No.: S.O. 848(E). Date of Notification: 23rd February, 2024. Date of Enforcement: 1st July, 2024. Exception: Provisions related to Section 106(2) in First Schedule. Published in: Gazette of India, Extraordinary, Part II, sec. 3(ii)",
        "hindi": "पाद टिप्पणी-1: प्रारंभ अधिसूचना विवरण। अधिसूचना संख्या: S.O. 848(E)। अधिसूचना की तारीख: 23 फरवरी, 2024। प्रवर्तन की तारीख: 1 जुलाई, 2024। अपवाद: पहली अनुसूची में धारा 106(2) से संबंधित प्रावधान। प्रकाशित: भारत का गजट, असाधारण, भाग II, सेक। 3(ii)"
      },
      "what": {
        "english": "Footnote-1 provides the specific details of how and when BNSS came into force. It references notification S.O. 848(E) dated 23rd February 2024, which appointed 1st July 2024 as the enforcement date, with one exception. Like fine print that gives the complete reference details for verification.",
        "hindi": "पाद टिप्पणी-1 BNSS कब और कैसे लागू हुआ इसका विशिष्ट विवरण प्रदान करती है। यह 23 फरवरी, 2024 की अधिसूचना S.O. 848(E) को संदर्भित करता है, जो 1 जुलाई, 2024 को प्रवर्तन तारीख के रूप में नियुक्त करती है, एक अपवाद के साथ। बारीक प्रिंट जैसा जो सत्यापन के लिए संपूर्ण संदर्भ विवरण देता है।"
      },
      "why": {
        "english": "Footnote-1 exists to provide official documentation and verification details. Legal documents need precise references so anyone can verify the information in official records. Like citing sources in research, it allows readers to check the original notification in the Gazette.",
        "hindi": "पाद टिप्पणी-1 आधिकारिक दस्तावेज़ीकरण और सत्यापन विवरण प्रदान करने के लिए मौजूद है। कानूनी दस्तावेज़ों को सटीक संदर्भ की आवश्यकता होती है ताकि कोई भी आधिकारिक रिकॉर्ड में जानकारी की सत्यापन कर सके। अनुसंधान में स्रोतों को उद्धृत करने की तरह, यह पाठकों को गजट में मूल अधिसूचना की जांच करने की अनुमति देता है।"
      },
      "where": {
        "english": "Footnote-1 appears at the bottom of Section 1, linked to Subsection-3. The actual notification can be found in the Gazette of India, Extraordinary, Part II, section 3(ii). Physical location: bottom of page; Reference location: Official Gazette archives.",
        "hindi": "पाद टिप्पणी-1 धारा 1 के नीचे दिखाई देती है, उप-धारा-3 से जुड़ी हुई है। वास्तविक अधिसूचना भारत के गजट, असाधारण, भाग II, सेक्शन 3(ii) में पाई जा सकती है। भौतिक स्थान: पृष्ठ के नीचे; संदर्भ स्थान: आधिकारिक गजट संग्रह।"
      },
      "when": {
        "english": "Footnote-1 references two key dates: Notification issued on 23rd February 2024, and enforcement began on 1st July 2024. Timeline: Law enacted 2023, Notification Feb 2024, Enforcement July 2024. About 4 months gap for implementation preparation.",
        "hindi": "पाद टिप्पणी-1 दो मुख्य तारीखों को संदर्भित करती है: 23 फरवरी, 2024 को अधिसूचना जारी, और 1 जुलाई, 2024 को प्रवर्तन शुरू। समय सारणी: कानून 2023 को अधिनियमित, अधिसूचना फरवरी 2024, प्रवर्तन जुलाई 2024। कार्यान्वयन तैयारी के लिए लगभग 4 महीने का अंतराल।"
      },
      "which": {
        "english": "Footnote-1 is the first (and only) footnote to Section 1. It identifies: (1) Which notification: S.O. 848(E), (2) Which exception: Section 106(2) in First Schedule, (3) Which publication: Gazette of India, Extraordinary. Among all documentation, this footnote pinpoints the exact official reference.",
        "hindi": "पाद टिप्पणी-1 धारा 1 के लिए पहली (और एकमात्र) पाद टिप्पणी है। यह पहचानती है: (1) कौन सी अधिसूचना: S.O. 848(E), (2) कौन सा अपवाद: पहली अनुसूची में धारा 106(2), (3) कौन सा प्रकाशन: भारत का गजट, असाधारण। सभी दस्तावेज़ों के बीच, यह पाद टिप्पणी सटीक आधिकारिक संदर्भ को इंगित करती है।"
      },
      "how": {
        "english": "Footnote-1 works as a documentation reference: Step 1: Links to Subsection-3's date mention. Step 2: Provides notification number (S.O. 848(E)). Step 3: States exact dates (issued 23-Feb, effective 1-Jul). Step 4: Notes exception in square brackets. Step 5: Gives Gazette publication details. Like a detailed citation that allows verification of every claim.",
        "hindi": "पाद टिप्पणी-1 एक दस्तावेज़ीकरण संदर्भ के रूप में काम करती है: चरण 1: उप-धारा-3 के दिनांक संदर्भ से जुड़ता है। चरण 2: अधिसूचना संख्या प्रदान करता है (S.O. 848(E))। चरण 3: सटीक तारीखें बताता है (23-फरवरी को जारी, 1-जुलाई को प्रभावी)। चरण 4: वर्ग कोष्ठक में अपवाद नोट करता है। चरण 5: गजट प्रकाशन विवरण देता है। एक विस्तृत उद्धरण जैसे जो प्रत्येक दावे की सत्यापन की अनुमति देता है।"
      }
    }
  }
}
