{
  "section1": {
    "title": "Short title, extent and commencement",
    "bare_act": {
      "id": "s1_bare_act",
      "title": "Section 1 - Complete Bare Act",
      "main": {
        "text": "Section 1: Short title, extent and commencement<br><br><strong>(1)</strong> This Act may be called the Bharatiya Nagarik Suraksha Sanhita, 2023.<br><br><strong>(2)</strong> The provisions of this Sanhita, other than those relating to Chapters IX, XI and XII thereof, shall not apply---<br>(a) to the State of Nagaland;<br>(b) to the tribal areas,<br>but the concerned State Government may, by notification, apply such provisions or any of them to the whole or part of the State of Nagaland or such tribal areas, as the case may be, with such supplemental, incidental or consequential modifications, as may be specified in the notification.<br><br><strong>Explanation.</strong>---In this section, 'tribal areas' means the territories which immediately before the 21st day of January, 1972, were included in the tribal areas of Assam, as referred to in paragraph 20 of the Sixth Schedule to the Constitution, other than those within the local limits of the municipality of Shillong.<br><br><strong>(3)</strong> It shall come into force on such date as the Central Government may, by notification in the Official Gazette, appoint.<br><br><strong>Footnote:</strong> 1st July, 2024, [except the provisions of the entry relation to Section 106(2) in the first Schedule], vide notification No. S.O. 848(E), dated, 23rd day of February, 2024, see Gazette of India, Extraordinary, Part II, sec. 3(ii).",
        "audioUrl": "BNSS-TTS-S1-BAREACT-MAIN.mp3"
      },
      "what": {
        "text": "The bare act of Section 1 contains three subsections: (1) Declares the official name 'Bharatiya Nagarik Suraksha Sanhita, 2023', (2) Provides exemptions for Nagaland and tribal areas from most provisions except Chapters IX, XI, XII, and (3) States the commencement date to be notified by Central Government. This is the complete legal text as enacted by Parliament.",
        "audioUrl": "BNSS-TTS-S1-BAREACT-WHAT.mp3"
      },
      "why": {
        "text": "The bare act text is important because it provides the exact legal language used in the statute. Courts and legal professionals rely on this precise wording for interpretation and application. Like reading the original Constitution rather than a summary - the exact words matter in law.",
        "audioUrl": "BNSS-TTS-S1-BAREACT-WHY.mp3"
      },
      "where": {
        "text": "This bare act text appears at the very beginning of the Bharatiya Nagarik Suraksha Sanhita, 2023. It is Section 1 of the Act, found in the official gazette notification. Located on the first pages of the official BNSS publication.",
        "audioUrl": "BNSS-TTS-S1-BAREACT-WHERE.mp3"
      },
      "when": {
        "text": "Section 1 was enacted in 2023 as part of BNSS. Subsection (3) states the Act came into force on 1st July, 2024, as notified by the Central Government. The law was passed in 2023 but became operational from July 1, 2024.",
        "audioUrl": "BNSS-TTS-S1-BAREACT-WHEN.mp3"
      },
      "which": {
        "text": "This is Section 1 of BNSS 2023, titled 'Short title, extent and commencement'. It is the foundational section containing three subsections that establish the law's identity, territorial extent, and effective date. Among all sections of BNSS, this is the introductory section that sets the stage.",
        "audioUrl": "BNSS-TTS-S1-BAREACT-WHICH.mp3"
      },
      "how": {
        "text": "Section 1 operates through three mechanisms: (1) Subsection-1 declares the name declaratively, (2) Subsection-2 creates exemptions with flexibility for State Governments to apply provisions through notification, (3) Subsection-3 delegates commencement power to Central Government. It establishes identity, scope, and timing all in one section.",
        "audioUrl": "BNSS-TTS-S1-BAREACT-HOW.mp3"
      }
    },
    "subsection_1": {
      "id": "ss1",
      "title": "Law's Official Name",
      "main": {
        "text": "Subsection-1: Law's Official Name<br><br>This law is called the 'Bharatiya Nagarik Suraksha Sanhita, 2023'. The complete title establishes the legal identity of this code. It consists of four Hindi words followed by the year 2023.",
        "audioUrl": "BNSS-TTS-S1-SS1-MAIN.mp3"
      },
      "what": {
        "text": "Subsection-1 states: This law is officially called 'Bharatiya Nagarik Suraksha Sanhita, 2023'. Just like saying 'My name is John' - this subsection declares the law's official name.",
        "audioUrl": "BNSS-TTS-S1-SS1-WHAT.mp3"
      },
      "why": {
        "text": "Subsection-1 exists to officially declare the law's name for legal recognition. Without this subsection, the law would have no formal identity. Like a birth certificate that officially names a child, this subsection officially names the law.",
        "audioUrl": "BNSS-TTS-S1-SS1-WHY.mp3"
      },
      "where": {
        "text": "Subsection-1 appears at the very beginning of the BNSS 2023 document. It is the first subsection of Section 1. Found on the opening page of the official BNSS text, before any other provisions.",
        "audioUrl": "BNSS-TTS-S1-SS1-WHERE.mp3"
      },
      "when": {
        "text": "Subsection-1 came into effect in 2023 when the law was enacted. This naming provision became official with the passage of the Act. Since 2023, this subsection has been the legal reference point for the law's name.",
        "audioUrl": "BNSS-TTS-S1-SS1-WHEN.mp3"
      },
      "which": {
        "text": "Subsection-1 is the naming clause of BNSS 2023. It is the first and foundational subsection of Section 1. Among all subsections, this is the one that specifically addresses the law's title.",
        "audioUrl": "BNSS-TTS-S1-SS1-WHICH.mp3"
      },
      "how": {
        "text": "Subsection-1 works by providing a simple declarative statement: 'This law is called...' It establishes legal nomenclature through direct declaration. Legal professionals cite this subsection when referencing the law's official name in documents.",
        "audioUrl": "BNSS-TTS-S1-SS1-HOW.mp3"
      }
    },
    "subsection_2": {
      "id": "ss2",
      "title": "Special Provisions for Nagaland and Tribal Areas",
      "main": {
        "text": "Subsection-2: Special Provisions for Nagaland and Tribal Areas<br><br>This subsection exempts Nagaland and tribal areas from most provisions of BNSS. Only Chapters IX, XI, and XII apply to these areas by default. State Governments can choose to apply other provisions with modifications.",
        "audioUrl": "BNSS-TTS-S1-SS2-MAIN.mp3"
      },
      "what": {
        "text": "Subsection-2 states that most provisions of BNSS do not apply to Nagaland and tribal areas, except Chapters IX, XI, and XII. State Governments can notify to apply other provisions with modifications. Like giving special autonomy to certain regions based on their unique needs.",
        "audioUrl": "BNSS-TTS-S1-SS2-WHAT.mp3"
      },
      "why": {
        "text": "Subsection-2 exists to respect the special constitutional status of Nagaland and tribal areas. These regions have unique cultural, social, and legal traditions that need protection. Like Article 371A which grants special provisions to Nagaland, this subsection ensures their autonomy while maintaining national legal framework.",
        "audioUrl": "BNSS-TTS-S1-SS2-WHY.mp3"
      },
      "where": {
        "text": "Subsection-2 applies to: (a) The State of Nagaland, and (b) Tribal areas as defined under the Constitution. These are specially protected regions with distinct legal status. Scheduled Areas under Fifth Schedule and Tribal Areas under Sixth Schedule of the Indian Constitution.",
        "audioUrl": "BNSS-TTS-S1-SS2-WHERE.mp3"
      },
      "when": {
        "text": "Subsection-2 came into effect with BNSS in 2023. State Governments can issue notifications at any time to apply provisions to these areas. There's no fixed timeline - it depends on when the State Government decides. A State can notify today, tomorrow, or years later based on their assessment.",
        "audioUrl": "BNSS-TTS-S1-SS2-WHEN.mp3"
      },
      "which": {
        "text": "Subsection-2 identifies: (1) Which areas are exempt: Nagaland and tribal areas. (2) Which chapters DO apply: Chapters IX, XI, and XII. (3) Which provisions DON'T apply: All other chapters. If BNSS has 20 chapters, only 3 automatically apply to these regions; remaining 17 are optional.",
        "audioUrl": "BNSS-TTS-S1-SS2-WHICH.mp3"
      },
      "how": {
        "text": "Subsection-2 works through a notification system: Step 1: State Government decides which provisions to apply. Step 2: Issues official notification. Step 3: Can add supplemental or consequential modifications. Step 4: Provisions become applicable as per notification. Like a menu where the State picks what legal provisions suit their region best.",
        "audioUrl": "BNSS-TTS-S1-SS2-HOW.mp3"
      }
    },
    "explanation_to_subsection_2": {
      "id": "ss2_explanation",
      "title": "Definition of Tribal Areas",
      "main": {
        "text": "Explanation to Subsection-2: Definition of Tribal Areas<br><br>Defines what 'tribal areas' means for the purpose of Subsection-2. Refers to territories included in Assam's tribal areas as of January 21, 1972. Excludes the municipality of Shillong from this definition. Based on Paragraph 20 of the Sixth Schedule to the Constitution.",
        "audioUrl": "BNSS-TTS-S1-SS2-EXP-MAIN.mp3"
      },
      "what": {
        "text": "The Explanation states: 'Tribal areas' means the territories which were part of Assam's tribal areas immediately before January 21, 1972, as mentioned in Paragraph 20 of the Sixth Schedule to the Constitution, except areas within Shillong municipality. Like defining a specific geographic region using a historical reference date.",
        "audioUrl": "BNSS-TTS-S1-SS2-EXP-WHAT.mp3"
      },
      "why": {
        "text": "This Explanation exists to provide legal clarity on which areas qualify as 'tribal areas' under Subsection-2. It prevents confusion by fixing a specific date (January 21, 1972) and constitutional reference. Like defining 'minor' as 'person below 18 years' - it removes ambiguity about who qualifies for special provisions.",
        "audioUrl": "BNSS-TTS-S1-SS2-EXP-WHY.mp3"
      },
      "where": {
        "text": "The Explanation applies to territories that were: (a) Part of Assam's tribal areas before January 21, 1972, (b) Mentioned in Paragraph 20 of Sixth Schedule, and (c) NOT within Shillong municipality limits. Areas like parts of Meghalaya that were tribal areas of Assam before 1972, excluding Shillong city.",
        "audioUrl": "BNSS-TTS-S1-SS2-EXP-WHERE.mp3"
      },
      "when": {
        "text": "The Explanation uses January 21, 1972 as the cut-off date. This is historically significant because it was when Meghalaya became a full state. Territories included as tribal areas 'immediately before' this date qualify. If an area was tribal area on January 20, 1972, it qualifies; if designated after January 21, 1972, it doesn't.",
        "audioUrl": "BNSS-TTS-S1-SS2-EXP-WHEN.mp3"
      },
      "which": {
        "text": "The Explanation identifies: (1) Which areas qualify: Former Assam tribal areas as of Jan 21, 1972. (2) Which constitutional provision: Paragraph 20 of Sixth Schedule. (3) Which areas are excluded: Shillong municipality. Of all tribal areas, only those meeting these three criteria qualify for Subsection-2 exemption.",
        "audioUrl": "BNSS-TTS-S1-SS2-EXP-WHICH.mp3"
      },
      "how": {
        "text": "The Explanation works by establishing three criteria: Step 1: Check if area was tribal area of Assam. Step 2: Verify status immediately before Jan 21, 1972. Step 3: Confirm it's referenced in Sixth Schedule Para 20. Step 4: Ensure it's NOT within Shillong municipality. Like a checklist - only areas meeting all conditions qualify as 'tribal areas' under BNSS.",
        "audioUrl": "BNSS-TTS-S1-SS2-EXP-HOW.mp3"
      }
    },
    "subsection_3": {
      "id": "ss3",
      "title": "Date of Commencement",
      "main": {
        "text": "Subsection-3: Date of Commencement<br><br>This law comes into force on the date notified by Central Government. The notification must be published in the Official Gazette. Different provisions may come into force on different dates. Actual enforcement date: 1st July, 2024 (with one exception).",
        "audioUrl": "BNSS-TTS-S1-SS3-MAIN.mp3"
      },
      "what": {
        "text": "Subsection-3 states: This law shall come into force on the date appointed by Central Government through official notification in the Gazette. The actual date notified was 1st July, 2024. Like announcing 'School will start from Monday' - this subsection announces when the law officially begins.",
        "audioUrl": "BNSS-TTS-S1-SS3-WHAT.mp3"
      },
      "why": {
        "text": "Subsection-3 exists because laws need a clear start date for implementation. It allows time for preparation: training officials, setting up systems, and informing the public. Like giving advance notice before new traffic rules - authorities need time to prepare before enforcing the law.",
        "audioUrl": "BNSS-TTS-S1-SS3-WHY.mp3"
      },
      "where": {
        "text": "Subsection-3 applies throughout India where BNSS is applicable (except exempt areas under Subsection-2). The notification is published in the Official Gazette of India. The commencement date is uniform across all non-exempt territories of India.",
        "audioUrl": "BNSS-TTS-S1-SS3-WHERE.mp3"
      },
      "when": {
        "text": "Subsection-3 became relevant on 23rd February, 2024 when the notification was issued. The law came into force on 1st July, 2024. Timeline: Law passed in 2023, Notification issued 23-Feb-2024, Enforcement began 01-Jul-2024. About 4 months between notification and actual implementation.",
        "audioUrl": "BNSS-TTS-S1-SS3-WHEN.mp3"
      },
      "which": {
        "text": "Subsection-3 is the commencement clause - the provision that activates the law. It is the third and final subsection of Section 1. Exception: Provisions related to Section 106(2) in First Schedule had different timing. 99% of BNSS started on 1st July 2024; one specific provision had separate timing.",
        "audioUrl": "BNSS-TTS-S1-SS3-WHICH.mp3"
      },
      "how": {
        "text": "Subsection-3 works through this mechanism: Step 1: Central Government decides readiness date. Step 2: Issues notification (S.O. 848(E) dated 23-Feb-2024). Step 3: Publishes in Official Gazette. Step 4: Law becomes enforceable on appointed date (01-Jul-2024). Like flipping a switch - one specific moment when the law 'turns on'.",
        "audioUrl": "BNSS-TTS-S1-SS3-HOW.mp3"
      }
    },
    "footnote_1": {
      "id": "footnote1",
      "title": "Commencement Date Notification Details",
      "main": {
        "text": "Footnote-1: Commencement Notification Details<br><br>Notification No.: S.O. 848(E)<br>Date of Notification: 23rd February, 2024<br>Date of Enforcement: 1st July, 2024<br>Exception: Provisions related to Section 106(2) in First Schedule<br>Published in: Gazette of India, Extraordinary, Part II, sec. 3(ii)",
        "audioUrl": "BNSS-TTS-S1-FN1-MAIN.mp3"
      },
      "what": {
        "text": "Footnote-1 provides the specific details of how and when BNSS came into force. It references notification S.O. 848(E) dated 23rd February 2024, which appointed 1st July 2024 as the enforcement date, with one exception. Like fine print that gives the complete reference details for verification.",
        "audioUrl": "BNSS-TTS-S1-FN1-WHAT.mp3"
      },
      "why": {
        "text": "Footnote-1 exists to provide official documentation and verification details. Legal documents need precise references so anyone can verify the information in official records. Like citing sources in research - it allows readers to check the original notification in the Gazette.",
        "audioUrl": "BNSS-TTS-S1-FN1-WHY.mp3"
      },
      "where": {
        "text": "Footnote-1 appears at the bottom of Section 1, linked to Subsection-3. The actual notification can be found in the Gazette of India, Extraordinary, Part II, section 3(ii). Physical location: bottom of page; Reference location: Official Gazette archives.",
        "audioUrl": "BNSS-TTS-S1-FN1-WHERE.mp3"
      },
      "when": {
        "text": "Footnote-1 references two key dates: Notification issued on 23rd February 2024, and enforcement began on 1st July 2024. Timeline: Law enacted 2023, Notification Feb 2024, Enforcement July 2024. About 4 months gap for implementation preparation.",
        "audioUrl": "BNSS-TTS-S1-FN1-WHEN.mp3"
      },
      "which": {
        "text": "Footnote-1 is the first (and only) footnote to Section 1. It identifies: (1) Which notification: S.O. 848(E), (2) Which exception: Section 106(2) in First Schedule, (3) Which publication: Gazette of India, Extraordinary. Among all documentation, this footnote pinpoints the exact official reference.",
        "audioUrl": "BNSS-TTS-S1-FN1-WHICH.mp3"
      },
      "how": {
        "text": "Footnote-1 works as a documentation reference: Step 1: Links to Subsection-3's date mention. Step 2: Provides notification number (S.O. 848(E)). Step 3: States exact dates (issued 23-Feb, effective 1-Jul). Step 4: Notes exception in square brackets. Step 5: Gives Gazette publication details. Like a detailed citation that allows verification of every claim.",
        "audioUrl": "BNSS-TTS-S1-FN1-HOW.mp3"
      }
    }
  }
}
